InformationRegisters/ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяДата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовыеДаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КассовыеДаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КассовыеДаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстрономическаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КассоваяДата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовыеДаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГраницыЗапретаИзмененияДанных/Ext/RecordSetModule.bsl
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение автозаполняемых реквизитов.
	МассивКассовыхДат = Новый Массив;
	Для Каждого Запись Из ЭтотОбъект Цикл
		МассивКассовыхДат.Добавить(Запись.КассоваяДата);
	КонецЦикла;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КассовыеДаты.КассоваяДата,
	                      |	КассовыеДаты.Дата
	                      |ИЗ
	                      |	РегистрСведений.КассовыеДаты КАК КассовыеДаты
	                      |ГДЕ
	                      |	КассовыеДаты.КассоваяДата В(&КассовыеДаты)");
	Запрос.УстановитьПараметр("КассовыеДаты", МассивКассовыхДат);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Выборка.НайтиСледующий(Запись.КассоваяДата, "КассоваяДата") Тогда
			Запись.ГраницаЗапретаИзменений = Выборка.Дата;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.ГраницаЗапретаИзменений) Тогда
			Запись.ГраницаЗапретаИзменений = ТекущаяДата();
		КонецЕсли;
		
		Если Отказ Тогда
			 Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
